Exp 4/4.3/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up - 10 requests/sec"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load - 50 requests/sec"
    - duration: 60
      arrivalRate: 100
      name: "Spike test - 100 requests/sec"
  processor: "./test-processor.js"

scenarios:
  - name: "Concurrent Booking Test"
    weight: 70
    flow:
      - post:
          url: "/api/book"
          json:
            seatNumber: "{{ $randomNumber(1, 100) }}"
            userId: "user_{{ $randomNumber(1, 1000) }}"
          capture:
            - json: "$.success"
              as: "bookingSuccess"
            - json: "$.message"
              as: "bookingMessage"

  - name: "Check Available Seats"
    weight: 20
    flow:
      - get:
          url: "/api/seats/available"

  - name: "Get Stats"
    weight: 10
    flow:
      - get:
          url: "/api/stats"